// Завдання 1
// Напишіть асинхронну функцію яка буде приймати 2 аргументи -
// довільний текст як перший аргумент та кількість мілісекунд як другий аргумент.
// Функція повинна виводити переданий текст через передану кількість мілісек

// function sayHi() {
//     console.log("Hello JS!")
//     setTimeout(()=> console.log("Hello again JS!"), 5_000 )
// }
//
// sayHi()

// Завдання 1
// Напишіть асинхронну функцію яка буде приймати 2 аргументи -
// довільний текст як перший аргумент та кількість мілісекунд як другий аргумент.
// Функція повинна виводити переданий текст через передану кількість мілісекунд.
async function printHello(text, milliseconds) {
    return new Promise((resolve) => {
        setTimeout(() => {
            console.log("Hello JS!")
            resolve()
        }, 1_000)
    })
}
printHello()